GopalSaraf/Practicals/PSDL/include/proc/pic16lf1554.inc
// Register: PWM2DCH
#define PWM2DCH PWM2DCH
PWM2DCH                                  equ 0615h
// bitfield definitions
PWM2DCH_PWM2DCH_POSN                     equ 0000h
PWM2DCH_PWM2DCH_POSITION                 equ 0000h
PWM2DCH_PWM2DCH_SIZE                     equ 0008h
PWM2DCH_PWM2DCH_LENGTH                   equ 0008h
PWM2DCH_PWM2DCH_MASK                     equ 00FFh
PWM2DCH_PWM2DCH0_POSN                    equ 0000h
PWM2DCH_PWM2DCH0_POSITION                equ 0000h
PWM2DCH_PWM2DCH0_SIZE                    equ 0001h
PWM2DCH_PWM2DCH0_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH0_MASK                    equ 0001h
PWM2DCH_PWM2DCH1_POSN                    equ 0001h
PWM2DCH_PWM2DCH1_POSITION                equ 0001h
PWM2DCH_PWM2DCH1_SIZE                    equ 0001h
PWM2DCH_PWM2DCH1_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH1_MASK                    equ 0002h
PWM2DCH_PWM2DCH2_POSN                    equ 0002h
PWM2DCH_PWM2DCH2_POSITION                equ 0002h
PWM2DCH_PWM2DCH2_SIZE                    equ 0001h
PWM2DCH_PWM2DCH2_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH2_MASK                    equ 0004h
PWM2DCH_PWM2DCH3_POSN                    equ 0003h
PWM2DCH_PWM2DCH3_POSITION                equ 0003h
PWM2DCH_PWM2DCH3_SIZE                    equ 0001h
PWM2DCH_PWM2DCH3_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH3_MASK                    equ 0008h
PWM2DCH_PWM2DCH4_POSN                    equ 0004h
PWM2DCH_PWM2DCH4_POSITION                equ 0004h
PWM2DCH_PWM2DCH4_SIZE                    equ 0001h
PWM2DCH_PWM2DCH4_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH4_MASK                    equ 0010h
PWM2DCH_PWM2DCH5_POSN                    equ 0005h
PWM2DCH_PWM2DCH5_POSITION                equ 0005h
PWM2DCH_PWM2DCH5_SIZE                    equ 0001h
PWM2DCH_PWM2DCH5_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH5_MASK                    equ 0020h
PWM2DCH_PWM2DCH6_POSN                    equ 0006h
PWM2DCH_PWM2DCH6_POSITION                equ 0006h
PWM2DCH_PWM2DCH6_SIZE                    equ 0001h
PWM2DCH_PWM2DCH6_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH6_MASK                    equ 0040h
PWM2DCH_PWM2DCH7_POSN                    equ 0007h
PWM2DCH_PWM2DCH7_POSITION                equ 0007h
PWM2DCH_PWM2DCH7_SIZE                    equ 0001h
PWM2DCH_PWM2DCH7_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH7_MASK                    equ 0080h

// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 0616h
// bitfield definitions
PWM2CON_PWM2POL_POSN                     equ 0004h
PWM2CON_PWM2POL_POSITION                 equ 0004h
PWM2CON_PWM2POL_SIZE                     equ 0001h
PWM2CON_PWM2POL_LENGTH                   equ 0001h
PWM2CON_PWM2POL_MASK                     equ 0010h
PWM2CON_PWM2OUT_POSN                     equ 0005h
PWM2CON_PWM2OUT_POSITION                 equ 0005h
PWM2CON_PWM2OUT_SIZE                     equ 0001h
PWM2CON_PWM2OUT_LENGTH                   equ 0001h
PWM2CON_PWM2OUT_MASK                     equ 0020h
PWM2CON_PWM2OE_POSN                      equ 0006h
PWM2CON_PWM2OE_POSITION                  equ 0006h
PWM2CON_PWM2OE_SIZE                      equ 0001h
PWM2CON_PWM2OE_LENGTH                    equ 0001h
PWM2CON_PWM2OE_MASK                      equ 0040h
PWM2CON_PWM2EN_POSN                      equ 0007h
PWM2CON_PWM2EN_POSITION                  equ 0007h
PWM2CON_PWM2EN_SIZE                      equ 0001h
PWM2CON_PWM2EN_LENGTH                    equ 0001h
PWM2CON_PWM2EN_MASK                      equ 0080h

// Register: AD1CON0
#define AD1CON0 AD1CON0
AD1CON0                                  equ 0711h
// bitfield definitions
AD1CON0_ADON_POSN                        equ 0000h
AD1CON0_ADON_POSITION                    equ 0000h
AD1CON0_ADON_SIZE                        equ 0001h
AD1CON0_ADON_LENGTH                      equ 0001h
AD1CON0_ADON_MASK                        equ 0001h
AD1CON0_GO_POSN                          equ 0001h
AD1CON0_GO_POSITION                      equ 0001h
AD1CON0_GO_SIZE                          equ 0001h
AD1CON0_GO_LENGTH                        equ 0001h
AD1CON0_GO_MASK                          equ 0002h
AD1CON0_CHS_POSN                         equ 0002h
AD1CON0_CHS_POSITION                     equ 0002h
AD1CON0_CHS_SIZE                         equ 0005h
AD1CON0_CHS_LENGTH                       equ 0005h
AD1CON0_CHS_MASK                         equ 007Ch
AD1CON0_GO_nDONE_POSN                    equ 0001h
AD1CON0_GO_nDONE_POSITION                equ 0001h
AD1CON0_GO_nDONE_SIZE                    equ 0001h
AD1CON0_GO_nDONE_LENGTH                  equ 0001h
AD1CON0_GO_nDONE_MASK                    equ 0002h
AD1CON0_CHS0_POSN                        equ 0002h
AD1CON0_CHS0_POSITION                    equ 0002h
AD1CON0_CHS0_SIZE                        equ 0001h
AD1CON0_CHS0_LENGTH                      equ 0001h
AD1CON0_CHS0_MASK                        equ 0004h
AD1CON0_CHS1_POSN                        equ 0003h
AD1CON0_CHS1_POSITION                    equ 0003h
AD1CON0_CHS1_SIZE                        equ 0001h
AD1CON0_CHS1_LENGTH                      equ 0001h
AD1CON0_CHS1_MASK                        equ 0008h
AD1CON0_CHS2_POSN                        equ 0004h
AD1CON0_CHS2_POSITION                    equ 0004h
AD1CON0_CHS2_SIZE                        equ 0001h
AD1CON0_CHS2_LENGTH                      equ 0001h
AD1CON0_CHS2_MASK                        equ 0010h
AD1CON0_CHS3_POSN                        equ 0005h
AD1CON0_CHS3_POSITION                    equ 0005h
AD1CON0_CHS3_SIZE                        equ 0001h
AD1CON0_CHS3_LENGTH                      equ 0001h
AD1CON0_CHS3_MASK                        equ 0020h
AD1CON0_CHS4_POSN                        equ 0006h
AD1CON0_CHS4_POSITION                    equ 0006h
AD1CON0_CHS4_SIZE                        equ 0001h
AD1CON0_CHS4_LENGTH                      equ 0001h
AD1CON0_CHS4_MASK                        equ 0040h
AD1CON0_GO_nDONE1_POSN                   equ 0001h
AD1CON0_GO_nDONE1_POSITION               equ 0001h
AD1CON0_GO_nDONE1_SIZE                   equ 0001h
AD1CON0_GO_nDONE1_LENGTH                 equ 0001h
AD1CON0_GO_nDONE1_MASK                   equ 0002h

// Register: ADCOMCON
#define ADCOMCON ADCOMCON
ADCOMCON                                 equ 0712h
// bitfield definitions
ADCOMCON_ADPREF_POSN                     equ 0000h
ADCOMCON_ADPREF_POSITION                 equ 0000h
ADCOMCON_ADPREF_SIZE                     equ 0002h
ADCOMCON_ADPREF_LENGTH                   equ 0002h
ADCOMCON_ADPREF_MASK                     equ 0003h
ADCOMCON_GO_nDONE_ALL_POSN               equ 0002h
ADCOMCON_GO_nDONE_ALL_POSITION           equ 0002h
ADCOMCON_GO_nDONE_ALL_SIZE               equ 0001h
ADCOMCON_GO_nDONE_ALL_LENGTH             equ 0001h
ADCOMCON_GO_nDONE_ALL_MASK               equ 0004h
ADCOMCON_ADCS_POSN                       equ 0004h
ADCOMCON_ADCS_POSITION                   equ 0004h
ADCOMCON_ADCS_SIZE                       equ 0003h
ADCOMCON_ADCS_LENGTH                     equ 0003h
ADCOMCON_ADCS_MASK                       equ 0070h
ADCOMCON_ADFM_POSN                       equ 0007h
ADCOMCON_ADFM_POSITION                   equ 0007h
ADCOMCON_ADFM_SIZE                       equ 0001h
ADCOMCON_ADFM_LENGTH                     equ 0001h
ADCOMCON_ADFM_MASK                       equ 0080h
ADCOMCON_ADPREF0_POSN                    equ 0000h
ADCOMCON_ADPREF0_POSITION                equ 0000h
ADCOMCON_ADPREF0_SIZE                    equ 0001h
ADCOMCON_ADPREF0_LENGTH                  equ 0001h
ADCOMCON_ADPREF0_MASK                    equ 0001h
ADCOMCON_ADPREF1_POSN                    equ 0001h
ADCOMCON_ADPREF1_POSITION                equ 0001h
ADCOMCON_ADPREF1_SIZE                    equ 0001h
ADCOMCON_ADPREF1_LENGTH                  equ 0001h
ADCOMCON_ADPREF1_MASK                    equ 0002h
ADCOMCON_GO_ALL_POSN                     equ 0002h
ADCOMCON_GO_ALL_POSITION                 equ 0002h
ADCOMCON_GO_ALL_SIZE                     equ 0001h
ADCOMCON_GO_ALL_LENGTH                   equ 0001h
ADCOMCON_GO_ALL_MASK                     equ 0004h
ADCOMCON_ADCS0_POSN                      equ 0004h
ADCOMCON_ADCS0_POSITION                  equ 0004h
ADCOMCON_ADCS0_SIZE                      equ 0001h
ADCOMCON_ADCS0_LENGTH                    equ 0001h
ADCOMCON_ADCS0_MASK                      equ 0010h
ADCOMCON_ADCS1_POSN                      equ 0005h
ADCOMCON_ADCS1_POSITION                  equ 0005h
ADCOMCON_ADCS1_SIZE                      equ 0001h
ADCOMCON_ADCS1_LENGTH                    equ 0001h
ADCOMCON_ADCS1_MASK                      equ 0020h
ADCOMCON_ADCS2_POSN                      equ 0006h
ADCOMCON_ADCS2_POSITION                  equ 0006h
ADCOMCON_ADCS2_SIZE                      equ 0001h
ADCOMCON_ADCS2_LENGTH                    equ 0001h
ADCOMCON_ADCS2_MASK                      equ 0040h

// Register: AD1CON2
#define AD1CON2 AD1CON2
AD1CON2                                  equ 0713h
// bitfield definitions
AD1CON2_TRIGSEL_POSN                     equ 0004h
AD1CON2_TRIGSEL_POSITION                 equ 0004h
AD1CON2_TRIGSEL_SIZE                     equ 0003h
AD1CON2_TRIGSEL_LENGTH                   equ 0003h
AD1CON2_TRIGSEL_MASK                     equ 0070h
AD1CON2_TRIGSEL0_POSN                    equ 0004h
AD1CON2_TRIGSEL0_POSITION                equ 0004h
AD1CON2_TRIGSEL0_SIZE                    equ 0001h
AD1CON2_TRIGSEL0_LENGTH                  equ 0001h
AD1CON2_TRIGSEL0_MASK                    equ 0010h
AD1CON2_TRIGSEL1_POSN                    equ 0005h
AD1CON2_TRIGSEL1_POSITION                equ 0005h
AD1CON2_TRIGSEL1_SIZE                    equ 0001h
AD1CON2_TRIGSEL1_LENGTH                  equ 0001h
AD1CON2_TRIGSEL1_MASK                    equ 0020h
AD1CON2_TRIGSEL2_POSN                    equ 0006h
AD1CON2_TRIGSEL2_POSITION                equ 0006h
AD1CON2_TRIGSEL2_SIZE                    equ 0001h
AD1CON2_TRIGSEL2_LENGTH                  equ 0001h
AD1CON2_TRIGSEL2_MASK                    equ 0040h

